#pragma once

// Outlast2 (1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class OLGame.ActorFactoryOLAmbientSound
// 0x0000 (0x00AC - 0x00AC)
class UActorFactoryOLAmbientSound : public UActorFactoryAkAmbientSound
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.ActorFactoryOLAmbientSound");
		return ptr;
	}

};


// Class OLGame.ActorFactoryOLAmbientSoundMovable
// 0x0000 (0x00AC - 0x00AC)
class UActorFactoryOLAmbientSoundMovable : public UActorFactoryOLAmbientSound
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.ActorFactoryOLAmbientSoundMovable");
		return ptr;
	}

};


// Class OLGame.ActorFactoryOLSoundEmittingMeshActor
// 0x0010 (0x00CC - 0x00BC)
class UActorFactoryOLSoundEmittingMeshActor : public UActorFactoryStaticMesh
{
public:
	class UAkEvent*                                    StartEvent;                                               // 0x00BC(0x0008) (Edit)
	class UAkEvent*                                    StopEvent;                                                // 0x00C4(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.ActorFactoryOLSoundEmittingMeshActor");
		return ptr;
	}

};


// Class OLGame.Interface_CornerOwner
// 0x0000 (0x0068 - 0x0068)
class UInterface_CornerOwner : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.Interface_CornerOwner");
		return ptr;
	}

};


// Class OLGame.OLActorFactoryInteractiveSkeletalFoliage
// 0x0000 (0x00BC - 0x00BC)
class UOLActorFactoryInteractiveSkeletalFoliage : public UActorFactoryInteractiveSkeletalFoliage
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLActorFactoryInteractiveSkeletalFoliage");
		return ptr;
	}

};


// Class OLGame.OLActorFactoryTripActor
// 0x0000 (0x00BC - 0x00BC)
class UOLActorFactoryTripActor : public UActorFactoryStaticMesh
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLActorFactoryTripActor");
		return ptr;
	}

};


// Class OLGame.OLAITrigger
// 0x0008 (0x0250 - 0x0248)
class AOLAITrigger : public AActor
{
public:
	class UCylinderComponent*                          CylinderComponent;                                        // 0x0248(0x0008) (Edit, Const, ExportObject, EditConst, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLAITrigger");
		return ptr;
	}


	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void NativeOnTouch(class AActor* Other);
	void PostBeginPlay();
};


// Class OLGame.OLAmbientSound
// 0x001C (0x0278 - 0x025C)
class AOLAmbientSound : public AAkAmbientSound
{
public:
	unsigned long                                      bAllowVirtualization : 1;                                 // 0x025C(0x0004) (Edit)
	unsigned long                                      bHighFidelityDynamicUpdate : 1;                           // 0x025C(0x0004) (Edit)
	TArray<class AOLAmbientSoundClone*>                Clones;                                                   // 0x0260(0x0010) (Edit, NeedCtorLink)
	float                                              MaxPathingDistance;                                       // 0x0270(0x0004) (Edit)
	float                                              MaximumAudibleRange;                                      // 0x0274(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLAmbientSound");
		return ptr;
	}

};


// Class OLGame.OLAmbientSoundMovable
// 0x000C (0x0284 - 0x0278)
class AOLAmbientSoundMovable : public AOLAmbientSound
{
public:
	class AOLSplineGameplayMarker*                     LinkedSpline;                                             // 0x0278(0x0008) (Edit)
	float                                              SplineOffset;                                             // 0x0280(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLAmbientSoundMovable");
		return ptr;
	}

};


// Class OLGame.OLAmbientSoundClone
// 0x001C (0x0264 - 0x0248)
class AOLAmbientSoundClone : public AActor
{
public:
	class USpriteComponent*                            SpriteComp;                                               // 0x0248(0x0008) (ExportObject, Component, EditInline)
	class AOLAmbientSound*                             Master;                                                   // 0x0250(0x0008) (Edit, EditConst)
	unsigned long                                      bAllowVirtualization : 1;                                 // 0x0258(0x0004) (Edit)
	float                                              MaxPathingDistance;                                       // 0x025C(0x0004) (Edit)
	float                                              MaximumAudibleRange;                                      // 0x0260(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLAmbientSoundClone");
		return ptr;
	}

};


// Class OLGame.OLArrow
// 0x025C (0x04A4 - 0x0248)
class AOLArrow : public AActor
{
public:
	unsigned long                                      bPreviewComponents : 1;                                   // 0x0248(0x0004) (Edit)
	unsigned long                                      bHasHitHero : 1;                                          // 0x0248(0x0004)
	unsigned long                                      bHasPlayedFlyBy : 1;                                      // 0x0248(0x0004)
	unsigned long                                      bFireActive : 1;                                          // 0x0248(0x0004) (Transient)
	unsigned long                                      bHasValidHeldByBotState : 1;                              // 0x0248(0x0004) (Transient)
	unsigned long                                      bAttachedToAnimatedSocket : 1;                            // 0x0248(0x0004) (Transient)
	unsigned long                                      bTransitionningAttachPoint : 1;                           // 0x0248(0x0004) (Transient)
	class UStaticMeshComponent*                        ArrowMesh;                                                // 0x024C(0x0008) (Edit, ExportObject, Component, EditInline)
	class UPointLightComponent*                        FirePointLight;                                           // 0x0254(0x0008) (Edit, ExportObject, Component, EditInline)
	class UParticleSystemComponent*                    FireEmitter1;                                             // 0x025C(0x0008) (Edit, ExportObject, Component, EditInline)
	class UParticleSystemComponent*                    FireEmitter2;                                             // 0x0264(0x0008) (Edit, ExportObject, Component, EditInline)
	class UParticleSystemComponent*                    BreakingPS;                                               // 0x026C(0x0008) (Edit, ExportObject, Component, EditInline)
	class UVolumetricFogLightComponent*                FogLight;                                                 // 0x0274(0x0008) (Edit, ExportObject, Component, EditInline)
	TEnumAsByte<EArrowState>                           ArrowState;                                               // 0x027C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x027D(0x0003) MISSED OFFSET
	float                                              LaunchTime;                                               // 0x0280(0x0004)
	float                                              StoppedTime;                                              // 0x0284(0x0004)
	float                                              DelayedDeleteTime;                                        // 0x0288(0x0004) (Transient)
	struct FArrowSettings                              Settings;                                                 // 0x028C(0x0064)
	struct FArrowPreciseTravelData                     PreciseTravel;                                            // 0x02F0(0x0034)
	struct FArrowShakeData                             Shake;                                                    // 0x0324(0x0014)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0338(0x0008) MISSED OFFSET
	struct FArrowLandingData                           Landing;                                                  // 0x0340(0x0040)
	struct FArrowWobbleData                            Wobble;                                                   // 0x0380(0x0014)
	unsigned char                                      UnknownData02[0xC];                                       // 0x0394(0x000C) MISSED OFFSET
	struct FArrowStuckDoorData                         StuckDoor;                                                // 0x03A0(0x0060)
	class AOLBot*                                      OwnerBot;                                                 // 0x0400(0x0008) (Transient)
	float                                              FireDeactivationTime;                                     // 0x0408(0x0004) (Transient)
	float                                              TransitionStartTime;                                      // 0x040C(0x0004) (Transient)
	struct FVector                                     TransitionStartLoc;                                       // 0x0410(0x000C) (Transient)
	struct FVector                                     TransitionStartDir;                                       // 0x041C(0x000C) (Transient)
	class AOLPawn*                                     StruckPawn;                                               // 0x0428(0x0008) (Transient)
	struct FVector                                     LastWaterCheckPosition;                                   // 0x0430(0x000C) (Transient)
	class ALandscapeProxy*                             ActiveWaterLandscape;                                     // 0x043C(0x0008) (Transient)
	class ULandscapeHeightfieldCollisionComponent*     LastWaterLandscapeCollidingComponent;                     // 0x0444(0x0008) (ExportObject, Transient, Component, EditInline)
	class UAkEvent*                                    FlyByEvent;                                               // 0x044C(0x0008) (Const)
	class UAkEvent*                                    ImpactEvent;                                              // 0x0454(0x0008) (Const)
	struct FString                                     ArrowSwitchGroup;                                         // 0x045C(0x0010) (Const, NeedCtorLink)
	struct FString                                     SwitchPlayerHit;                                          // 0x046C(0x0010) (Const, NeedCtorLink)
	struct FString                                     SwitchWindowHit;                                          // 0x047C(0x0010) (Const, NeedCtorLink)
	struct FString                                     SwitchOtherHit;                                           // 0x048C(0x0010) (Const, NeedCtorLink)
	struct FName                                       HeroThroatSocketName;                                     // 0x049C(0x0008) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLArrow");
		return ptr;
	}

};


// Class OLGame.OLBasementWindow
// 0x0044 (0x028C - 0x0248)
class AOLBasementWindow : public AActor
{
public:
	unsigned long                                      bDisabled : 1;                                            // 0x0248(0x0004) (Edit)
	unsigned long                                      bHalfBasement : 1;                                        // 0x0248(0x0004) (Edit)
	unsigned long                                      bInitiallyDisabled : 1;                                   // 0x0248(0x0004) (Transient)
	unsigned long                                      bHeroInteracting : 1;                                     // 0x0248(0x0004) (Transient)
	float                                              ExplicitOcclusionFactor;                                  // 0x024C(0x0004) (Edit)
	float                                              DefaultOcclusionFactor;                                   // 0x0250(0x0004) (Edit, EditConst)
	TArray<class UMaterialInstance*>                   MaterialOverrides;                                        // 0x0254(0x0010) (Edit, NeedCtorLink)
	float                                              WindowHeight;                                             // 0x0264(0x0004) (Edit, EditConst)
	float                                              WindowWidth;                                              // 0x0268(0x0004) (Edit, EditConst)
	class UStaticMeshComponent*                        FrameMesh;                                                // 0x026C(0x0008) (Edit, ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        WindowMesh;                                               // 0x0274(0x0008) (Edit, ExportObject, Component, EditInline)
	class UDynamicLightEnvironmentComponent*           WindowLightEnvironment;                                   // 0x027C(0x0008) (Edit, ExportObject, Component, EditInline)
	class UOLSoundConnectorComponent*                  SoundConnectorComp;                                       // 0x0284(0x0008) (Edit, ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBasementWindow");
		return ptr;
	}


	void OnToggle(class USeqAct_Toggle* Action);
};


// Class OLGame.OLHeroCamera
// 0x0378 (0x03E0 - 0x0068)
class UOLHeroCamera : public UObject
{
public:
	class AOLHero*                                     Hero;                                                     // 0x0068(0x0008)
	struct FCamView                                    ViewWS;                                                   // 0x0070(0x0018)
	struct FCamView                                    ViewCS;                                                   // 0x0088(0x0018)
	struct FViewLimits                                 Limits;                                                   // 0x00A0(0x0010)
	struct FViewLimits                                 SoftLimits;                                               // 0x00B0(0x0010)
	float                                              SoftZonePitch;                                            // 0x00C0(0x0004)
	float                                              SoftZoneYaw;                                              // 0x00C4(0x0004)
	struct FRotator                                    BaseRotation;                                             // 0x00C8(0x000C)
	struct FVector                                     BaseLocation;                                             // 0x00D4(0x000C)
	struct FSmoothingData                              BaseViewSmoothing;                                        // 0x00E0(0x0024)
	float                                              InputYaw;                                                 // 0x0104(0x0004)
	float                                              InputPitch;                                               // 0x0108(0x0004)
	float                                              NeckOffsetFwd;                                            // 0x010C(0x0004)
	float                                              NeckOffsetSide;                                           // 0x0110(0x0004)
	float                                              NeckOffsetBaseYaw;                                        // 0x0114(0x0004)
	float                                              PositionOffset;                                           // 0x0118(0x0004)
	struct FVector                                     PositionOffsetDir;                                        // 0x011C(0x000C)
	float                                              LookBackRatio;                                            // 0x0128(0x0004)
	float                                              LeanPushingRatio;                                         // 0x012C(0x0004)
	unsigned long                                      bActiveLookAt : 1;                                        // 0x0130(0x0004)
	unsigned long                                      bHardLookAt : 1;                                          // 0x0130(0x0004)
	unsigned long                                      bUserControlsPawnRotation : 1;                            // 0x0130(0x0004)
	unsigned long                                      bLocalSpacePlayerControl : 1;                             // 0x0130(0x0004)
	unsigned long                                      bFullCameraPassthrough : 1;                               // 0x0130(0x0004)
	unsigned long                                      bBugFixCheck : 1;                                         // 0x0130(0x0004) (Transient)
	unsigned long                                      bHasLockedWSYaw : 1;                                      // 0x0130(0x0004) (Transient)
	float                                              LookAtAlpha;                                              // 0x0134(0x0004)
	struct FViewLimits                                 LookAtStartViewLimits;                                    // 0x0138(0x0010)
	float                                              PendingYawCorrection;                                     // 0x0148(0x0004)
	float                                              SpringLastValidInput;                                     // 0x014C(0x0004)
	float                                              RotationRoll;                                             // 0x0150(0x0004)
	float                                              ProceduralRollEnabledness;                                // 0x0154(0x0004)
	float                                              LastForceFeedbackIntensity;                               // 0x0158(0x0004)
	float                                              StabilizationRatio;                                       // 0x015C(0x0004)
	float                                              PitchStabilizationRatio;                                  // 0x0160(0x0004)
	struct FTargettedSmoothingData                     TargettedYawSmoothing;                                    // 0x0164(0x0014)
	struct FTargettedSmoothingData                     TargettedPitchSmoothing;                                  // 0x0178(0x0014)
	struct FCameraShakeData                            DefaultShakeData;                                         // 0x018C(0x0098)
	struct FCameraShakeList                            ShakeDataList[0x4];                                       // 0x0224(0x0010) (Transient, NeedCtorLink)
	struct FCameraShakeData                            SmallLandingShakeData;                                    // 0x0264(0x0098) (Const)
	struct FCameraShakeData                            MinorStepShakeData;                                       // 0x02FC(0x0098) (Const)
	class UForceFeedbackWaveform*                      CamShakeFFWaveform;                                       // 0x0394(0x0008)
	float                                              ProceduralAdditivePitch;                                  // 0x039C(0x0004)
	float                                              CameraSpringStiffness;                                    // 0x03A0(0x0004) (Config)
	struct FName                                       CameraBoneName;                                           // 0x03A4(0x0008) (Config)
	float                                              ViewLimitsSoftZone;                                       // 0x03AC(0x0004) (Config)
	float                                              DefaultCameraSpringStiffness;                             // 0x03B0(0x0004) (Config)
	float                                              GamepadLookDeadZone;                                      // 0x03B4(0x0004) (Config)
	float                                              GamepadSpringDelay;                                       // 0x03B8(0x0004) (Config)
	float                                              MaxStabilizationRatio;                                    // 0x03BC(0x0004) (Config)
	float                                              YawInputTimeStamp;                                        // 0x03C0(0x0004) (Transient)
	float                                              PitchInputTimeStamp;                                      // 0x03C4(0x0004) (Transient)
	float                                              MinWSAdditivePitch;                                       // 0x03C8(0x0004) (Transient)
	float                                              MaxWSAdditivePitch;                                       // 0x03CC(0x0004) (Transient)
	float                                              LockedWSYaw;                                              // 0x03D0(0x0004) (Transient)
	float                                              SmoothAnimatedLookbackForwardOffset;                      // 0x03D4(0x0004) (Transient)
	float                                              SmoothAnimatedLookbackSideOffset;                         // 0x03D8(0x0004) (Transient)
	float                                              SmoothAnimatedLookbackUpwardOffset;                       // 0x03DC(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLHeroCamera");
		return ptr;
	}

};


// Class OLGame.OLBashableObject
// 0x00FC (0x0344 - 0x0248)
class AOLBashableObject : public AActor
{
public:
	struct FPointer                                    VfTable_IInterface_NavMeshPathObstacle;                   // 0x0248(0x0008) (Const, Native, NoExport)
	unsigned long                                      bEnabled : 1;                                             // 0x0250(0x0004) (Edit)
	unsigned long                                      bCanBreakForward : 1;                                     // 0x0250(0x0004) (Edit)
	unsigned long                                      bCanBreakBackward : 1;                                    // 0x0250(0x0004) (Edit)
	unsigned long                                      bCameraShakeOnBreak : 1;                                  // 0x0250(0x0004) (Edit)
	unsigned long                                      bBreaking : 1;                                            // 0x0250(0x0004) (Transient)
	unsigned long                                      bBroken : 1;                                              // 0x0250(0x0004) (Transient)
	unsigned long                                      bBrokenFwd : 1;                                           // 0x0250(0x0004) (Transient)
	unsigned long                                      bObstacleRegistered : 1;                                  // 0x0250(0x0004) (Transient)
	unsigned long                                      bInitiallyEnabled : 1;                                    // 0x0250(0x0004) (Transient)
	TArray<struct FBashableTriggerData>                TriggersForward;                                          // 0x0254(0x0010) (Edit, NeedCtorLink)
	TArray<struct FBashableTriggerData>                TriggersBackward;                                         // 0x0264(0x0010) (Edit, NeedCtorLink)
	float                                              PlayerTriggerDistFwd;                                     // 0x0274(0x0004) (Edit)
	float                                              PlayerTriggerDistSide;                                    // 0x0278(0x0004) (Edit)
	float                                              BreakDurationFwd;                                         // 0x027C(0x0004) (Edit)
	float                                              BreakDurationBwd;                                         // 0x0280(0x0004) (Edit)
	float                                              SpawnPointOffset;                                         // 0x0284(0x0004) (Edit)
	class UAkEvent*                                    BreakingSoundEvent;                                       // 0x0288(0x0008) (Edit)
	struct FCameraShakeData                            CamShakeParams;                                           // 0x0290(0x0098) (Edit)
	class UStaticMeshComponent*                        Mesh;                                                     // 0x0328(0x0008) (Edit, ExportObject, Component, EditInline)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x0330(0x0008) (Edit, ExportObject, Component, EditInline)
	float                                              NavmeshObstacleWidth;                                     // 0x0338(0x0004) (Edit)
	float                                              NavmeshObstacleDepth;                                     // 0x033C(0x0004) (Edit)
	float                                              BreakStartedTime;                                         // 0x0340(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBashableObject");
		return ptr;
	}


	void OnToggle(class USeqAct_Toggle* Action);
};


// Class OLGame.OLBlockingObject
// 0x0014 (0x025C - 0x0248)
class AOLBlockingObject : public AActor
{
public:
	struct FPointer                                    VfTable_IInterface_NavMeshPathObstacle;                   // 0x0248(0x0008) (Const, Native, NoExport)
	unsigned long                                      bEnabled : 1;                                             // 0x0250(0x0004) (Edit)
	unsigned long                                      bInitiallyEnabled : 1;                                    // 0x0250(0x0004) (Transient)
	class UStaticMeshComponent*                        Mesh;                                                     // 0x0254(0x0008) (Edit, ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBlockingObject");
		return ptr;
	}


	void OnToggle(class USeqAct_Toggle* Action);
	void OnDisable();
	void OnEnable();
};


// Class OLGame.OLBotCondition
// 0x0004 (0x006C - 0x0068)
class UOLBotCondition : public UObject
{
public:
	unsigned long                                      bInversed : 1;                                            // 0x0068(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_AllOfSubConditions
// 0x0010 (0x007C - 0x006C)
class UOLBotCondition_AllOfSubConditions : public UOLBotCondition
{
public:
	TArray<class UOLBotCondition*>                     SubConditions;                                            // 0x006C(0x0010) (Edit, ExportObject, NeedCtorLink, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_AllOfSubConditions");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_AnyOfSubConditions
// 0x0010 (0x007C - 0x006C)
class UOLBotCondition_AnyOfSubConditions : public UOLBotCondition
{
public:
	TArray<class UOLBotCondition*>                     SubConditions;                                            // 0x006C(0x0010) (Edit, ExportObject, NeedCtorLink, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_AnyOfSubConditions");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_CloseToAnotherBot
// 0x0008 (0x0074 - 0x006C)
class UOLBotCondition_CloseToAnotherBot : public UOLBotCondition
{
public:
	float                                              MaxHorzDistance;                                          // 0x006C(0x0004) (Edit)
	float                                              MaxVertDistance;                                          // 0x0070(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_CloseToAnotherBot");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_CloseToPlayer
// 0x0008 (0x0074 - 0x006C)
class UOLBotCondition_CloseToPlayer : public UOLBotCondition
{
public:
	float                                              MaxHorzDistance;                                          // 0x006C(0x0004) (Edit)
	float                                              MaxVertDistance;                                          // 0x0070(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_CloseToPlayer");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_CloseToPoint
// 0x0010 (0x007C - 0x006C)
class UOLBotCondition_CloseToPoint : public UOLBotCondition
{
public:
	class AActor*                                      TestActor;                                                // 0x006C(0x0008) (Edit)
	float                                              MaxHorzDistance;                                          // 0x0074(0x0004) (Edit)
	float                                              MaxVertDistance;                                          // 0x0078(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_CloseToPoint");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_Difficulty
// 0x0002 (0x006E - 0x006C)
class UOLBotCondition_Difficulty : public UOLBotCondition
{
public:
	TEnumAsByte<EBotDifficultyCondition>               ConditionType;                                            // 0x006C(0x0001) (Edit)
	TEnumAsByte<EDifficultyMode>                       Difficulty;                                               // 0x006D(0x0001) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_Difficulty");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_FacingPlayer
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_FacingPlayer : public UOLBotCondition
{
public:
	float                                              MaxAngle;                                                 // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_FacingPlayer");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_FacingPoint
// 0x000C (0x0078 - 0x006C)
class UOLBotCondition_FacingPoint : public UOLBotCondition
{
public:
	class AActor*                                      TestActor;                                                // 0x006C(0x0008) (Edit)
	float                                              MaxAngle;                                                 // 0x0074(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_FacingPoint");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_FasterThan
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_FasterThan : public UOLBotCondition
{
public:
	float                                              Speed;                                                    // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_FasterThan");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_GameFlow
// 0x0014 (0x0080 - 0x006C)
class UOLBotCondition_GameFlow : public UOLBotCondition
{
public:
	TEnumAsByte<EGameFlowCondition>                    Condition;                                                // 0x006C(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x006D(0x0003) MISSED OFFSET
	struct FName                                       ControlName;                                              // 0x0070(0x0008) (Edit)
	struct FName                                       RangeEndCheckpoint;                                       // 0x0078(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_GameFlow");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_HasAttackedPlayer
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_HasAttackedPlayer : public UOLBotCondition
{
public:
	float                                              TimeWindow;                                               // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_HasAttackedPlayer");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_HasBeenDisturbed
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_HasBeenDisturbed : public UOLBotCondition
{
public:
	float                                              TimeWindow;                                               // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_HasBeenDisturbed");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_HasLostSightAfterChase
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_HasLostSightAfterChase : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_HasLostSightAfterChase");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_HasSeenPlayer
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_HasSeenPlayer : public UOLBotCondition
{
public:
	float                                              TimeWindow;                                               // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_HasSeenPlayer");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_HasStoppedChasing
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_HasStoppedChasing : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_HasStoppedChasing");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_InvestigationCount
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_InvestigationCount : public UOLBotCondition
{
public:
	int                                                Count;                                                    // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_InvestigationCount");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_InVolume
// 0x0008 (0x0074 - 0x006C)
class UOLBotCondition_InVolume : public UOLBotCondition
{
public:
	class AVolume*                                     TestVolume;                                               // 0x006C(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_InVolume");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_IsAtSpawnLocation
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_IsAtSpawnLocation : public UOLBotCondition
{
public:
	float                                              MaxDistance;                                              // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_IsAtSpawnLocation");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_IsChasing
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_IsChasing : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_IsChasing");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_IsInvestigating
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_IsInvestigating : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_IsInvestigating");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_IsPatrolling
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_IsPatrolling : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_IsPatrolling");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_IsVisibleByPlayer
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_IsVisibleByPlayer : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_IsVisibleByPlayer");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerCloseToPoint
// 0x0010 (0x007C - 0x006C)
class UOLBotCondition_PlayerCloseToPoint : public UOLBotCondition
{
public:
	class AActor*                                      TestActor;                                                // 0x006C(0x0008) (Edit)
	float                                              MaxHorzDistance;                                          // 0x0074(0x0004) (Edit)
	float                                              MaxVertDistance;                                          // 0x0078(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerCloseToPoint");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerFasterThan
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_PlayerFasterThan : public UOLBotCondition
{
public:
	float                                              Speed;                                                    // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerFasterThan");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerInNightVision
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_PlayerInNightVision : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerInNightVision");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerInSight
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_PlayerInSight : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerInSight");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerInVolume
// 0x0008 (0x0074 - 0x006C)
class UOLBotCondition_PlayerInVolume : public UOLBotCondition
{
public:
	class AVolume*                                     TestVolume;                                               // 0x006C(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerInVolume");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerIsCrawling
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_PlayerIsCrawling : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerIsCrawling");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerIsCrouched
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_PlayerIsCrouched : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerIsCrouched");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerIsFacing
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_PlayerIsFacing : public UOLBotCondition
{
public:
	float                                              MaxAngle;                                                 // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerIsFacing");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerIsHiding
// 0x000C (0x0078 - 0x006C)
class UOLBotCondition_PlayerIsHiding : public UOLBotCondition
{
public:
	class AActor*                                      HidingLocation;                                           // 0x006C(0x0008) (Edit)
	float                                              MinimumDuration;                                          // 0x0074(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerIsHiding");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerIsHurt
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_PlayerIsHurt : public UOLBotCondition
{
public:
	float                                              MaxHealth;                                                // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerIsHurt");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerIsPushing
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_PlayerIsPushing : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerIsPushing");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerIsStanding
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_PlayerIsStanding : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerIsStanding");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerLitByFlashlight
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_PlayerLitByFlashlight : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerLitByFlashlight");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerUsingCamcorder
// 0x0000 (0x006C - 0x006C)
class UOLBotCondition_PlayerUsingCamcorder : public UOLBotCondition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerUsingCamcorder");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_PlayerWasChased
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_PlayerWasChased : public UOLBotCondition
{
public:
	float                                              MaxTimeAgo;                                               // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_PlayerWasChased");
		return ptr;
	}

};


// Class OLGame.OLBotCondition_WasSeenByPlayer
// 0x0004 (0x0070 - 0x006C)
class UOLBotCondition_WasSeenByPlayer : public UOLBotCondition
{
public:
	float                                              TimeWindow;                                               // 0x006C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBotCondition_WasSeenByPlayer");
		return ptr;
	}

};


// Class OLGame.OLBugTracker
// 0x0030 (0x0098 - 0x0068)
class UOLBugTracker : public UObject
{
public:
	struct FString                                     BugTrackerProject;                                        // 0x0068(0x0010) (Config, NeedCtorLink)
	TArray<struct FOLBugTrackerBinding>                BugTrackerBindings;                                       // 0x0078(0x0010) (Config, NeedCtorLink)
	struct FString                                     DefaultBugTrackerName;                                    // 0x0088(0x0010) (Config, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBugTracker");
		return ptr;
	}

};


// Class OLGame.OLCamcorderFilesHud
// 0x0144 (0x0330 - 0x01EC)
class UOLCamcorderFilesHud : public UGFxMoviePlayer
{
public:
	class AOLHUD*                                      HUD;                                                      // 0x01EC(0x0008)
	unsigned long                                      bVisible : 1;                                             // 0x01F4(0x0004)
	unsigned long                                      bDynamicalyLoadedVOBankLoaded : 1;                        // 0x01F4(0x0004) (Transient)
	unsigned long                                      bWaitingForDynamicallyLoadedVOBank : 1;                   // 0x01F4(0x0004) (Transient)
	unsigned long                                      bShowFoundOnly : 1;                                       // 0x01F4(0x0004) (Config)
	unsigned long                                      HiRezCamcorderPhotoTexturesIndexChanged : 1;              // 0x01F4(0x0004) (Transient)
	unsigned long                                      bVideoEnded : 1;                                          // 0x01F4(0x0004) (Transient)
	unsigned long                                      bIgnoreLoadingTexture : 1;                                // 0x01F4(0x0004)
	class UGFxObject*                                  FolderList;                                               // 0x01F8(0x0008) (Transient)
	TArray<class UGFxObject*>                          FolderSubList;                                            // 0x0200(0x0010) (Transient, NeedCtorLink)
	TArray<struct FString>                             TypeNameList;                                             // 0x0210(0x0010) (Const, NeedCtorLink)
	TArray<struct FString>                             DisplayGroundNameList;                                    // 0x0220(0x0010) (Const, NeedCtorLink)
	TEnumAsByte<ESortingCategoryType>                  SortingType;                                              // 0x0230(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0231(0x0003) MISSED OFFSET
	class UAkEvent*                                    PauseVOSndEvent;                                          // 0x0234(0x0008)
	class UAkEvent*                                    ResumeVOSndEvent;                                         // 0x023C(0x0008)
	class UAkEvent*                                    MoveCursorSndEvent;                                       // 0x0244(0x0008)
	class UAkEvent*                                    SelectSndEvent;                                           // 0x024C(0x0008)
	class UAkEvent*                                    BackSndEvent;                                             // 0x0254(0x0008)
	class UAkEvent*                                    DynamicalyLoadedVO;                                       // 0x025C(0x0008) (Transient)
	class UAkEvent*                                    CustomVideoEventStart;                                    // 0x0264(0x0008) (Transient)
	class UAkEvent*                                    CustomVideoEventStop;                                     // 0x026C(0x0008) (Transient)
	TArray<struct FCamcorderRecord>                    CamcorderRecords;                                         // 0x0274(0x0010) (Config, NeedCtorLink)
	int                                                SplitCamcorderRecordIndex;                                // 0x0284(0x0004) (Config)
	TArray<struct FCachedNamedTexture>                 HiRezCamcorderPhotoTextures;                              // 0x0288(0x0010) (Transient, NeedCtorLink)
	struct FName                                       HiRezCamcorderPhotoName;                                  // 0x0298(0x0008) (Transient)
	int                                                HiRezCamcorderPhotoTexturesIndex;                         // 0x02A0(0x0004) (Transient)
	float                                              HiRezCamcorderPhotoTextureScale;                          // 0x02A4(0x0004) (Transient)
	struct FVector2D                                   HiRezCamcorderPhotoTextureTranslation;                    // 0x02A8(0x0008) (Transient)
	struct FVector2D                                   HiRezCamcorderPhotoTextureTranslationSmoothInput;         // 0x02B0(0x0008) (Transient)
	TArray<struct FCachedNamedTexture>                 ThumbnailCamcorderPhotoTextures;                          // 0x02B8(0x0010) (Transient, AlwaysInit, NeedCtorLink)
	TArray<struct FCachedThumbnailData>                LatestThumbnailCamcorderPhotoTextures;                    // 0x02C8(0x0010) (Transient, AlwaysInit, NeedCtorLink)
	struct FCachedThumbnailData                        LatestFullSizedPhotoTexture;                              // 0x02D8(0x0020) (Transient, NeedCtorLink)
	TArray<class UTexture2D*>                          FolderThumbnailCamcorderPhotoTextures;                    // 0x02F8(0x0010) (Transient, AlwaysInit, NeedCtorLink)
	TArray<class UTexture2D*>                          TypeThumbnailCamcorderPhotoTextures;                      // 0x0308(0x0010) (Transient, AlwaysInit, NeedCtorLink)
	int                                                ThumbnailCamcorderPhotoTexturesListIndex;                 // 0x0318(0x0004) (Transient)
	int                                                ThumbnailCamcorderPhotoTexturesStartIndex;                // 0x031C(0x0004) (Transient)
	int                                                RecordingVOPlayingId;                                     // 0x0320(0x0004) (Transient)
	float                                              MaxZoomFactor;                                            // 0x0324(0x0004) (Const)
	float                                              DelayBeforeVO;                                            // 0x0328(0x0004) (Transient)
	float                                              LastHUDSoundTimestamp;                                    // 0x032C(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLCamcorderFilesHud");
		return ptr;
	}


	void SetPCInputLabel(const struct FString& navigationLabelUp, const struct FString& navigationLabelLeft, const struct FString& navigationLabelDown, const struct FString& navigationLabelRight, const struct FString& nextLabel, const struct FString& previousLabel, const struct FString& backLabel, const struct FString& displayLabel, const struct FString& playLabel, const struct FString& selectLabelText);
	void SetPCInputLabelFunction(const struct FString& navigationLabelUp, const struct FString& navigationLabelLeft, const struct FString& navigationLabelDown, const struct FString& navigationLabelRight, const struct FString& nextLabel, const struct FString& previousLabel, const struct FString& backLabel, const struct FString& displayLabel, const struct FString& playLabel, const struct FString& selectLabelText);
	void selectConsole(const struct FString& Console);
	void UsingPC();
	void UsingXboxOne();
	void UsingPS4();
	void SetSouthPaw(bool bSouthPaw);
	void SetLocalizedText(const struct FString& zoomLabel, const struct FString& navigationLabel, const struct FString& cleanTextLabel, const struct FString& selectLabel, const struct FString& backLabel, const struct FString& previousLabel, const struct FString& nextLabel, const struct FString& playLabel, const struct FString& pauseLabel, const struct FString& moveImage);
	void PopulateFolderList(bool bRefreshOnly);
	bool WidgetInitialized(const struct FName& WidgetName, const struct FName& WidgetPath, class UGFxObject* Widget);
	void HideImageNavigateLabel();
	void ShowImageNavigateLabel();
	void Pause();
	void TogglePlayPause();
	void InputTypeChanged();
	void NativeInputTypeChanged();
	void NativePlaySound(class UAkEvent* SndEvent);
	void OnStop();
	void NativeOnStop();
	void NativeFullStop();
	void OnPlay();
	void NativeOnPlay();
	void OnDisplayChange();
	void NativeOnDisplayChange();
	void OnMove();
	void OnSelect();
	void OnBack();
	void OnBackOnRootMenu();
	void NativeOnBackOnRootMenu();
	void OnScrollToIndexChange(int ListIndex, int StartIndex, int endIndex);
	void NativeOnScrollToIndexChange(int ListIndex, int StartIndex, int endIndex, bool bForce);
	void OnFullScaleImageChanged(bool bInView, const struct FString& photoName);
	void NativeOnFullScaleImageChanged(bool bInView, const struct FString& photoName);
	void NativeQuickOpen();
	void SetLargePhotoURL(int folderIndex, int imageIndex, const struct FString& largePhotoURL);
	void SelectRecording(int folderIndex, int imageIndex);
	bool SetAllowSingleFolder(bool bAllowSingleFolder);
	bool SetDisplayLabel(const struct FString& Label);
	void SetVisible(bool bShow);
	void FlagRecordingAsRead(int folderIndex, int recordingIndex);
	void DisplayChange();
	void RefreshData();
	bool SetListFocusIndex(int indexA, int indexB, int indexC, int indexD, int indexE, int indexF);
	bool SetLargeImageSize(float SizeX, float SizeY, float PosX, float PosY);
	void DisallowInputChangeFocus();
	void AllowInputChangeFocus();
	bool PauseVideo();
	bool ConfigUI();
	bool back();
	bool BackToMainMenu();
	bool Next();
	bool Previous();
	bool RefreshLargeImage();
	bool FilterButtonInput(int ControllerId, const struct FName& ButtonName, TEnumAsByte<EInputEvent> InputEvent);
};


// Class OLGame.OLCamcorderHud
// 0x00AC (0x0298 - 0x01EC)
class UOLCamcorderHud : public UGFxMoviePlayer
{
public:
	class AOLHUD*                                      HUD;                                                      // 0x01EC(0x0008)
	unsigned long                                      bVisible : 1;                                             // 0x01F4(0x0004)
	unsigned long                                      bPaused : 1;                                              // 0x01F4(0x0004)
	struct FCamcorderHudObjects                        Objects;                                                  // 0x01F8(0x0070) (Transient)
	struct FCamcorderHudState                          HudState;                                                 // 0x0268(0x0030) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLCamcorderHud");
		return ptr;
	}


	void UpdateRecordingTime(float DeltaTime);
	bool WidgetInitialized(const struct FName& WidgetName, const struct FName& WidgetPath, class UGFxObject* Widget);
	void HandleUnpaused();
	void HandlePaused();
	void SetVisible(bool bShow);
};


// Class OLGame.OLCameraActor
// 0x0000 (0x04AC - 0x04AC)
class AOLCameraActor : public ACameraActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLCameraActor");
		return ptr;
	}


	void GetCameraView(float DeltaTime, struct FTPOV* OutPOV);
	void NativeGetCameraView(struct FTPOV* OutPOV);
};


// Class OLGame.OLCharacterProxy
// 0x0043 (0x00D0 - 0x008D)
class UOLCharacterProxy : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x008D(0x0003) MISSED OFFSET
	struct FPointer                                    ControllerProxy;                                          // 0x0090(0x0008) (Const, Native)
	int                                                CollisionGroups;                                          // 0x0098(0x0004) (Const)
	float                                              Radius;                                                   // 0x009C(0x0004)
	float                                              HalfHeight;                                               // 0x00A0(0x0004)
	float                                              SlopedPushDistance;                                       // 0x00A4(0x0004)
	class AOLPawn*                                     Pawn;                                                     // 0x00A8(0x0008)
	float                                              MeshXOffset;                                              // 0x00B0(0x0004) (Transient)
	float                                              AccelerationWithNoMovementTime;                           // 0x00B4(0x0004) (Transient)
	float                                              SimplifiedStuckTime;                                      // 0x00B8(0x0004) (Transient)
	struct FVector                                     LastMoveVelocity;                                         // 0x00BC(0x000C) (Transient)
	unsigned long                                      StuckLastFrame : 1;                                       // 0x00C8(0x0004) (Transient)
	unsigned long                                      MovedLastFrame : 1;                                       // 0x00C8(0x0004) (Transient)
	unsigned long                                      bStuckOptimOn : 1;                                        // 0x00C8(0x0004) (Transient)
	float                                              StuckOptimRetryTimeAcc;                                   // 0x00CC(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLCharacterProxy");
		return ptr;
	}

};


// Class OLGame.OLTutorialManager
// 0x0234 (0x029C - 0x0068)
class UOLTutorialManager : public UObject
{
public:
	unsigned long                                      bTutorialsEnabled : 1;                                    // 0x0068(0x0004) (Config)
	unsigned long                                      bActiveTutorial : 1;                                      // 0x0068(0x0004)
	unsigned long                                      bActiveTutorialCanBePaused : 1;                           // 0x0068(0x0004)
	unsigned long                                      bLongerTutorial : 1;                                      // 0x0068(0x0004)
	unsigned long                                      bQuickTutorialIfInteraction : 1;                          // 0x0068(0x0004)
	unsigned long                                      bPaused : 1;                                              // 0x0068(0x0004) (Transient)
	int                                                CurrentID;                                                // 0x006C(0x0004)
	struct FString                                     TutorialText;                                             // 0x0070(0x0010) (NeedCtorLink)
	TEnumAsByte<EHUDMessagePriority>                   TutorialPriority;                                         // 0x0080(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0081(0x0003) MISSED OFFSET
	TArray<struct FString>                             CompletedTutorials;                                       // 0x0084(0x0010) (NeedCtorLink)
	float                                              ActiveTutorialDelay;                                      // 0x0094(0x0004)
	float                                              TutorialItemTimestamp;                                    // 0x0098(0x0004)
	float                                              LookBackTutorialReminderTimeLeft;                         // 0x009C(0x0004)
	float                                              LastLookBackTutorialReminderPushedTimestamp;              // 0x00A0(0x0004)
	float                                              LookBackTutorialIntervalTime;                             // 0x00A4(0x0004) (Config)
	float                                              PeekTutorialReminderTimeLeft;                             // 0x00A8(0x0004)
	float                                              LastPeekTutorialReminderPeekPushedTimestamp;              // 0x00AC(0x0004)
	float                                              PeekTutorialIntervalTime;                                 // 0x00B0(0x0004) (Config)
	float                                              MicrophoneTutorialReminderTimeLeft;                       // 0x00B4(0x0004)
	float                                              LastMicrophoneTutorialReminderPeekPushedTimestamp;        // 0x00B8(0x0004)
	float                                              MicrophoneTutorialIntervalTime;                           // 0x00BC(0x0004) (Config)
	struct FContextualTutorialsData                    CompletedContextualTutorials;                             // 0x00C0(0x0004)
	int                                                ClimbUpTutorialItemIdx;                                   // 0x00C4(0x0004)
	float                                              DefaultTutorialDuration;                                  // 0x00C8(0x0004) (Const)
